In [2]:
import pandas as pd
from pandas import Series, DataFrame
data = {'Chinese': [66, 95, 93, 90,80],'English': [65, 85, 92, 88, 90],'Math': [30, 98, 96, 77, 90]}
df = DataFrame(data, index=['ZhangFei', 'GuanYu', 'ZhaoYun', 'HuangZhong', 'DianWei'])
df

            Chinese  English  Math
ZhangFei         66       65    30
GuanYu           95       85    98
ZhaoYun          93       92    96
HuangZhong       90       88    77
DianWei          80       90    90

In [10]:
h_data=pd.read_csv('/Users/rickie/Desktop/mysql_learning/melb_data.csv')

### 查看数据

In [47]:
h_data.isnull().sum()
h_data.describe()
h_data.info()
# df.isnull().sum()
# df.isnull().any()
h_data.dtypes # 查看数据格式

<class 'pandas.core.frame.DataFrame'>
Int64Index: 13518 entries, 0 to 13579
Data columns (total 21 columns):
Suburb           13518 non-null object
Address          13518 non-null object
Rooms            13518 non-null int64
Type             13518 non-null object
Price            13518 non-null float64
Method           13518 non-null object
SellerG          13518 non-null object
Date             13518 non-null object
Distance         13518 non-null float64
Postcode         13518 non-null float64
Bedroom2         13518 non-null float64
Bathroom         13518 non-null float64
Car              13518 non-null float64
Landsize         13518 non-null float64
BuildingArea     13518 non-null float64
YearBuilt        13518 non-null float64
CouncilArea      13518 non-null object
Lattitude        13518 non-null float64
Longtitude       13518 non-null float64
Regionname       13518 non-null object
Propertycount    13518 non-null float64
dtypes: float64(12), int64(1), object(8)
memory usage: 2.3+ MB

Suburb            object
Address           object
Rooms              int64
Type              object
Price            float64
Method            object
SellerG           object
Date              object
Distance         float64
Postcode         float64
Bedroom2         float64
Bathroom         float64
Car              float64
Landsize         float64
BuildingArea     float64
YearBuilt        float64
CouncilArea       object
Lattitude        float64
Longtitude       float64
Regionname        object
Propertycount    float64
dtype: object

In [11]:
h_data.head()

,Suburb,Address,Rooms,Type,Price,Method,SellerG,Date,Distance,Postcode,...,Bathroom,Car,Landsize,BuildingArea,YearBuilt,CouncilArea,Lattitude,Longtitude,Regionname,Propertycount
0,Abbotsford,85 Turner St,2,h,1480000.0,S,Biggin,3/12/2016,2.5,3067.0,...,1.0,1.0,202.0,NaN,NaN,Yarra,-37.7996,144.9984,Northern Metropolitan,4019.0
1,Abbotsford,25 Bloomburg St,2,h,1035000.0,S,Biggin,4/02/2016,2.5,3067.0,...,1.0,0.0,156.0,79.0,1900.0,Yarra,-37.8079,144.9934,Northern Metropolitan,4019.0
2,Abbotsford,5 Charles St,3,h,1465000.0,SP,Biggin,4/03/2017,2.5,3067.0,...,2.0,0.0,134.0,150.0,1900.0,Yarra,-37.8093,144.9944,Northern Metropolitan,4019.0
3,Abbotsford,40 Federation La,3,h,850000.0,PI,Biggin,4/03/2017,2.5,3067.0,...,2.0,1.0,94.0,NaN,NaN,Yarra,-37.7969,144.9969,Northern Metropolitan,4019.0
4,Abbotsford,55a Park St,4,h,1600000.0,VB,Nelson,4/06/2016,2.5,3067.0,...,1.0,2.0,120.0,142.0,2014.0,Yarra,-37.8072,144.9941,Northern Metropolitan,4019.0

### 清洗数据

In [57]:
# 处理缺失数据

h_data['BuildingArea'].fillna(h_data['BuildingArea'].mean(),inplace=True) # 填充缺失值

max_v=h_data['YearBuilt'].value_counts().index[0] # 用最多数值填充缺失值
h_data['YearBuilt'].fillna(max_v,inplace=True)

h_data.dropna(subset=['Car'],inplace=True) # 删除Car为空的所有列


h_data.CouncilArea.fillna('Unknown',inplace=True)

h_data.drop_duplicates() # 检查是否有重复数据

h_data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 13518 entries, 0 to 13579
Data columns (total 21 columns):
Suburb           13518 non-null object
Address          13518 non-null object
Rooms            13518 non-null int64
Type             13518 non-null object
Price            13518 non-null float64
Method           13518 non-null object
SellerG          13518 non-null object
Date             13518 non-null object
Distance         13518 non-null float64
Postcode         13518 non-null float64
Bedroom2         13518 non-null float64
Bathroom         13518 non-null float64
Car              13518 non-null float64
Landsize         13518 non-null float64
BuildingArea     13518 non-null float64
YearBuilt        13518 non-null int64
CouncilArea      13518 non-null object
Lattitude        13518 non-null float64
Longtitude       13518 non-null float64
Regionname       13518 non-null object
Propertycount    13518 non-null float64
dtypes: float64(11), int64(2), object(8)
memory usage: 2.3+ MB

### 转换数据格式

In [58]:
h_data['YearBuilt']=h_data['YearBuilt'].astype(int)

### 使用sql语句操作pandas DataFrame

In [37]:
import pandas as pd
from pandas import DataFrame
from pandasql import sqldf, load_meat, load_births
df1 = DataFrame({'name':['ZhangFei', 'GuanYu', 'a', 'b', 'c'], 'data1':range(5)})
pysqldf = lambda x: sqldf(x, globals())
sql = "select * from df1 where name ='ZhangFei'"
pysqldf(sql)

       name  data1
0  ZhangFei      0

### 合并df

In [54]:
df1 = DataFrame({'name':['ZhangFei', 'GuanYu', 'a', 'b', 'c'], 'data1':range(5),'data3':['dddd','e','a','f','z']})
df2 = DataFrame({'name':['ZhangFei', 'GuanYu', 'A', 'B', 'C'], 'data1':range(5)})

In [61]:
pd.merge(df1,df2,how='inner')

       name  data1 data3
0  ZhangFei      0  dddd
1    GuanYu      1     e

### apply函数的使用

In [16]:
def plus(df,n,m):
    df['new1'] = (df[u'Chinese']+df[u'English']) * m
    df['new2'] = (df[u'Chinese']+df[u'English']) * n
    return df
df.apply(plus,axis=1,args=(2,3))# args=不可省略

            English  Math  Chinese  new1  new2
ZhangFei         65    30       66   393   262
GuanYu           85    98       95   540   360
ZhaoYun          92    96       93   555   370
HuangZhong       88    77       90   534   356
DianWei          90    90       80   510   340